Repository: aroth-arsoft/apt-cacher-ng
Catalog: debian/po/*.po
Languages: cs, fr, ru

source: Set up once
cs: Nastavit jednou
fr: Configurer une seule fois
ru: Настроить один раз

source: Set up now and update later
cs: Nastavit nyní a průběžně aktualizovat
fr: Configurer maintenant et mettre à jour plus tard
ru: Настроить сейчас и позже обновлять

source: No automated setup
cs: Nenastavovat automaticky
fr: Pas de configuration automatique
ru: Не настраивать автоматически

source: Automatic remapping of client requests:
cs: Automatické přesměrování klientských požadavků:
fr: Redirection automatique des requêtes :
ru: Автоматическое переназначение клиентских запросов:

source: Apt-Cacher NG can download packages from repositories other than those requested by the clients. This allows it to cache content effectively, and makes it easy for an administrator to switch to another mirror later. The URL remapping can be set up automatically, using a configuration based on the current state of /etc/apt/sources.list.
cs: Apt-Cacher NG umí stahovat balíky i z jiných repositářů, než které si vyžádali klienti. To umožňuje efektivní používání lokální mezipaměti a také to správcům umožňuje jednoduše měnit používané zrcadlo. Přepisování URL je možné nastavit automaticky na základě aktuálního obsahu /etc/apt/sources.list.
fr: Apt-Cacher NG peut télécharger des paquets depuis d'autres dépôts que ceux demandés par les clients. Cela permet de mettre les données en cache efficacement et facilite la tâche de l'administrateur lors d'un changement ultérieur de miroir. La redirection d'URL peut être configurée automatiquement en reprenant des éléments de l'état courant de /etc/apt/sources.list.
ru: Apt-Cacher NG может скачивать пакеты из репозиториев, отличных от запрашиваемых клиентами. Это позволяет эффективней кэшировать данные, и легко изменять сервер-зеркало, если потребуется. Это переназначение может быть настроено автоматически, исходя из актуального содержания файла /etc/apt/sources.list.

source: Please specify whether the remapping should be configured once now, or reconfigured on every update of Apt-Cacher NG (modifying the configuration files each time), or left unconfigured.
cs: Vyberte si, zda se má přesměrování nastavit pouze jednou (nyní), při každé aktualizaci Apt-Cacher NG, nebo ponechat nenastavené.
fr: Veuillez indiquer si la redirection doit être configurée une seule fois maintenant, ou bien lors de chaque mise à jour de Apt-Cacher NG (les fichiers de configuration seront modifiés à chaque fois), ou encore laissée non configurée.
ru: Выбирайте, когда настройка переназначение URL будет происходить: однократно (сейчас), после каждого обновления Apt-Cacher NG (позже переписывает конфигурацию), или никогда.

source: Selecting "No automated setup" will leave the existing configuration unchanged. It will need to be updated manually.
cs: Možnost „Nenastavovat automaticky“ ponechá stávající nastavení nedotčeno a budete je muset upravit ručně.
fr: Le choix « Pas de configuration automatique » conserve la configuration existante. Vous devrez alors la mettre à jour vous-même.
ru: При выборе «Не настраивать автоматически» существующая настройка не изменится. В этом случае обновления нужно будет делать вручную.

source: Listening address(es) for Apt-Cacher NG:
cs: Adresy, na kterých má Apt-Cacher NG naslouchat:
fr: Adresse(s) d'écoute pour Apt-Cacher NG :
ru: Прослушиваемыe адрес(а) для Apt-Cacher NG:

source: Please specify the local addresses that Apt-Cacher NG should listen on (multiple entries must be separated by spaces).
cs: Zadejte lokální adresy, na kterých má Apt-Cacher NG naslouchat (adresy musí být odděleny mezerami).
fr: Veuillez indiquer les adresses locales qu'Apt-Cacher NG doit écouter (liste d'adresses séparées par des espaces).
ru: Укажите адреса или имена узлов, на которых нужно выполнять прослушивание; несколько элементов нужно разделять пробелами.

source: Each entry must be an IP address or hostname associated with a local network interface. Generic protocol-specific addresses are also supported, such as 0.0.0.0 for listening on all IPv4-enabled interfaces.
cs: Každý záznam musí být IP adresou nebo jménem počítače svázaným s lokálním síťovým rozhraním. Podporovány jsou i obecné adresy jako např. 0.0.0.0 pro naslouchání na všech rozhraních s IPv4.
fr: Chaque entrée doit être ou bien une adresse IP, ou bien un nom d'hôte associé à une interface sur le réseau local. Les adresses génériques définies par un protocole sont acceptées, par exemple 0.0.0.0 pour écouter sur toutes les interfaces compatibles IPv4.
ru: Каждый элемент должен быть адресом (IP или именем узла), который связан с локальным сетевым интерфейсом. Поддерживаются обобщённые адреса протоколов, например 0.0.0.0 служит для прослушивания на всех интерфейсах с включённым IPv4.

source: If this field is left empty, Apt-Cacher NG will listen on all interfaces, with all supported protocols.
cs: Ponecháte-li prázdné, bude Apt-Cacher NG naslouchat na všech rozhraních všemi podporovanými protokoly.
fr: Si ce champ est laissé vide, Apt-Cacher NG écoutera sur toutes les interfaces, avec tous les protocoles pris en charge.
ru: Если ничего не указывать (по умолчанию), то прослушивание ведётся на всех интерфейсах и по всем протоколам.

source: The special word "keep" keeps the value from the current (or default) configuration unchanged.
cs: Speciální slovo „keep“ ponechá hodnotu ze současného (nebo výchozího) nastavení.
fr: Le mot-clef « keep » conserve inchangée la valeur issue de la configuration actuelle (ou par défaut).
ru: Специальное слово «keep» служит для сохранения текущего (или по умолчанию) значения настройки.

source: Listening TCP port:
cs: TCP port:
fr: Port d'écoute TCP :
ru: Прослушиваемый порт TCP:

source: Please specify the TCP port that Apt-Cacher NG should listen on for incoming HTTP (proxy) requests. The default value is port 3142, but it can be set to 9999 to emulate apt-proxy.
cs: Zadejte TCP port, na kterém má Apt-Cacher NG naslouchat příchozím HTTP požadavkům. Výchozí port je 3142, ale pro emulaci apt-proxy můžete použít hodnotu 9999.
fr: Veuillez indiquer le port TCP sur lequel Apt-Cacher NG doit être à l'écoute des requêtes HTTP (proxy) entrantes. La valeur par défaut est le port 3142, mais on peut indiquer 9999 pour émuler apt-proxy.
ru: Укажите порт TCP, на котором Apt-Cacher NG должен принимать входящие запросы HTTP (прокси). По умолчанию используется порт 3142; для эмуляции apt-proxy можно указать значение 9999.

source: If this field is left empty, the value from the current configuration remains unchanged.
cs: Ponecháte-li prázdné, použije se hodnota ze současného nastavení.
fr: Si ce champ est laissé vide, la valeur issue de la configuration courante est conservée.
ru: Если ничего не указывать, то текущее значение настройки не изменяется.

source: Top-level directory for package cache:
cs: Hlavní adresář pro cache balíků:
fr: Répertoire racine pour le cache des paquets :
ru: Каталоге верхнего уровня кэша пакетов:

source: The main cache storage directory should be located on a file system without file name restrictions.
cs: Hlavní adresář pro uchovávání cache balíků by měl být umístěn na souborovém systému, který neomezuje názvy souborů.
fr: Le répertoire de stockage du cache principal devrait résider sur un système de fichiers exempt de restrictions quant au nommage des fichiers.
ru: Каталог главного кэша хранилища пакетов должен располагаться в файловой системе без ограничений на имена файлов.

source: If this field is left empty, the value from the current configuration remains unchanged or is set to the default of /var/cache/apt-cacher-ng.
cs: Ponecháte-li prázdné, použije se hodnota ze stávajícího nastavení, nebo výchozí hodnota /var/cache/apt-cacher-ng.
fr: Si ce champ est laissé vide, la valeur issue de la configuration courante est conservée ou bien remplacée par la valeur par défaut /var/cache/apt-cacher-ng.
ru: Если ничего не указывать, то текущее значение настройки не изменяется или по умолчанию устанавливается значение каталога /var/cache/apt-cacher-ng.

source: Proxy to use for downloads:
cs: Proxy pro stahování:
fr: Serveur mandataire (« proxy ») à utiliser pour les téléchargements :
ru: Прокси, используемый для скачивания:

source: Please specify the proxy server to use for downloads.
cs: Zadejte proxy server pro stahování.
fr: Veuillez indiquer le serveur mandataire à utiliser pour les téléchargements.
ru: Пожалуйста укажите прокси, используемый для скачивания:

source: Username and password for the proxy server can be included here following the user:pass@host:port scheme. However, please check the documentation for limitations.
cs: Případné uživatelské jméno a heslo k proxy serveru můžete zadat ve tvaru uživatel:heslo@počítač:port. Podrobnosti a omezení tohoto přístupu naleznete v dokumentaci.
fr: L'identifiant et le mot de passe pour le serveur mandataire peuvent figurer ici en suivant la convention syntaxique identifiant:motdepasse@serveur:port. Cependant, veuillez consulter la documentation quant aux limitations de cette méthode.
ru: Имя пользователя и пароль прокси-сервера можно указать в виде схемы пользователь:пароль@узел:порт, но смотрите описание ограничений в руководстве. Если ничего не указывать, то используется непосредственное соединение.

source: If this field is left empty, Apt-Cacher NG will not use any proxy server.
cs: Ponecháte-li prázdné, Apt-Cacher NG nebude používat žádný proxy server.
fr: Si ce champ est laissé vide, Apt-Cacher NG n'utilisera pas de serveur mandataire (« proxy »).
ru: Если не указано, Apt-Cacher NG не будет использовать других прокси.
